import { StyleSheet, Text, View, ScrollView } from 'react-native'
import React from 'react'

const GeographyEnvironment = () => {
  return (
    <ScrollView style={styles.scrollView}>
      <View style={styles.container}>

        <Text style={styles.question}> नेपालको भौतिक भूगोल र पर्यावरण:</Text>
        <Text style={styles.question}>
          Q1. नेपालको मुख्य भौगोलिक क्षेत्रहरू के हुन् र तिनीहरूले देशको भौगोलिक विविधतामा कसरी योगदान पुर्‍याउँछन्?
        </Text>
        <Text style={styles.answer}>
          नेपाल एक भौगोलिक रूपमा विविधतामय देश हो जसमा पर्वतीय, मध्य उच्चीय, तराई, तथा हिमालयी क्षेत्रहरू रहेका छन्।{'\n'}
          <Text style={styles.boldText}>1. हिमालयी क्षेत्र:</Text> {'\n'}
          यो भाग नेपालको उत्तरी भागमा पर्छ र विशेषतः तत्कालीन पहाडी क्षेत्रहरू जस्तै की अन्नपूर्णा, लङ्गताङ, धौलागिरी, गौरीशङ्कर, इवटेस्ट, काञ्चनजङ्घा, इत्यादि संग निर्दिष्ट हुन्छ।{'\n'}
          यो क्षेत्र नेपालको प्राकृतिक सौन्दर्यका लागि प्रसिद्ध छ, यसले पर्यटनमा महत्त्वपूर्ण योगदान गरेको छ।{'\n'}
          <Text style={styles.boldText}>2. मध्य उच्चीय क्षेत्र:</Text> {'\n'}
          यो क्षेत्र पर्वतीय छोटो-ठुलो विकासशील क्षेत्रहरूले बनाइएको छ।{'\n'}
          केही मुख्य भौतिक प्रान्तहरू छन्: काठमाडौं उपत्यका, पोखरा उपत्यका, तानहुँ उपत्यका, इत्यादि।{'\n'}
          यो क्षेत्रले पनि पर्यटन, कृषि, र विभिन्न उद्योगहरूमा योगदान गर्दछ।{'\n'}
          <Text style={styles.boldText}>3. तराई:</Text> {'\n'}
          यो क्षेत्र नेपालको दक्षिणी भागमा पर्छ र यसमा चितवन, बुटवल, बिर्तामोड, धनगढी, इत्यादि उपत्यकाहरू रहेका छन्।{'\n'}
          यो क्षेत्र फैलिएको मध्यम तराई र उच्च तराईका देखि पर्दा पर्छ।{'\n'}
          यो क्षेत्र फसल उत्पादन, वन्यजन्तु तथा उद्योगमा महत्त्वपूर्ण भूमिका खेल्दछ।{'\n'}
        </Text>
        <Text style={styles.question}>Q2. नेपालको भौतिक स्थिति दक्षिण एसियामा कसरी महत्त्वपूर्ण छ र यसको व्यापार र जनगणनामा के प्रभाव छ?</Text>
        <Text style={styles.question}>
          1. रणनीतिक स्थान:
        </Text>
        <Text style={styles.answer}>
          नेपाल भारत र चीन, दुई महत्वपूर्ण शक्तिहरूको बीचको भूभागको क्षेत्रमा रहेको एक बफर राष्ट्रको रूपमा काम गर्दछ। यसको योगदानले क्षेत्रीय गतिविधिहरू र प्रभावको धारण गर्दछ।
        </Text>
        <Text style={styles.question}>
          2. हिमालयी स्रोतहरू:
        </Text>
        <Text style={styles.answer}>
          नेपालमा हिमालयी श्रेणी, विशेषतः संसारको उच्चतम शिखर एभरेस्ट सहित, अत्यधिक पारिस्थितिक, जलवायुतात्त्विक र जैविक महत्त्व रहेको छ। यसको प्रभावले नेपाल र क्षेत्रभरको जलवायु, पानीको स्रोत र जैविक विविधतामा पर्याप्त प्रभाव गर्दछ।
        </Text>
        <Text style={styles.question}>
          3. व्यापारी रास्ता:
        </Text>
        <Text style={styles.answer}>
          नेपाल भारत र चीनको बीचमा व्यापार र वाणिज्यका लागि एक पारित देशको रूपमा काम गर्दछ। ऐतिहासिक रूपमा, यो प्राचीन सिल्क रोडको महत्त्वपूर्ण बिन्दु रहेको थियो र आज पनि दक्षिण एशियामा भारत र पूर्व एशियामा चीन बीचको माल, सामग्री र वाणिज्यमा महत्त्वपूर्ण स्थान राख्ने रहेको छ।
        </Text>
        <Text style={styles.question}>
          4. जलविद्युत सम्भावना:
        </Text>
        <Text style={styles.answer}>
          नेपालमा पारिस्थितिकीय रूपमा पानीको प्रचुरता छ। विशेषतः हिमालयबाट आउने नदीहरूले हाइड्रोपावर उत्पादनको बहुमुखी सम्भावनाहरू प्रदान गर्दछन्, जुन यो क्षेत्रको ऊर्जा मागको पूर्ति गर्ने क्षमता छ।
        </Text>
        <Text style={styles.question}>
          5. सांस्कृतिक र धार्मिक महत्व:
        </Text>
        <Text style={styles.answer}>
          नेपाल विविध सांस्कृतिक, भाषिक र धार्मिक समृद्धि का केन्द्र हो। हिन्दू र बौद्धिक तीर्थस्थलहरूको समृद्धि र पर्यटकहरू र पिलग्रिमहरूलाई पुल्चौ गर्दछ, जसले नेपालको अर्थतन्त्र र अन्तर्राष्ट्रिय सम्बन्धमा योगदान गर्दछ।
        </Text>
        <Text style={styles.question}>
          6. जनसंख्या पर्यावरणमा प्रभाव:
        </Text>
        <Text style={styles.answer}>
          नेपालको भौतिक विशेषताहरूले निवास प्रणाली र जनसंख्यामा प्रभाव गरेको छ। यसले अलग-अलग भागमा अलग-अलग नृत्य र भाषाका समुदायहरूलाई निवास गराउँछ, जसले नेपाललाई समृद्ध सांस्कृतिक विविधतामा योगदान गर्दछ।
        </Text>
        <Text style={styles.answer}>
          संक्षेपमा, नेपालको दक्षिण एसियामा भौतिक स्थिति यसको रणनीतिक स्थिति, प्राकृतिक स्रोतहरू, व्यापार र वाणिज्य, र सांस्कृतिक धरोहर, जसले तत्कालीन राष्ट्रिय व्यापार, जनसंख्या, र क्षेत्रीय गतिविधिहरूमा गहिरो प्रभाव गर्दछ।
        </Text>


        <Text style={styles.question}>Q3.नेपालले वन फँडानी, माटोको क्षय र जल प्रदूषण जस्ता विभिन्न वातावरणीय चुनौतीहरूको सामना गरिरहेको छ।
          कृपया यी समस्याहरूलाई सम्बोधन गर्न समाधानहरू सुझाव दिनुहोस्।</Text>

        <Text style={styles.answer}>
          नेपालले सामना गरिरहेका वातावरणीय चुनौतिहरूलाई सम्बोधन गर्न यहाँ केही सुझाव दिइएका समाधानहरू छन्: <Text />{'\n'}
          <Text style={styles.boldText}>वन फँडानी: </Text>
          अवैध वृक्षारोपण रोक्न र पुनरुत्थान प्रयासहरूलाई बढावा दिन कडा नियमहरू र प्रवर्तन उपायहरू लागू गर्नुहोस्। सामुदायिक वन व्यवस्थापन पहलहरूलाई प्रोत्साहित गर्ने र जैविक विविधता र जलवायु नियमनका लागि वन संरक्षणको महत्त्वबारे चेतना जगाउने। {"\n"}
          <Text style={styles.boldText}> माटो क्षरण: </Text>
          माटोको क्षरण कम गर्न टेरेसिङ, कृषि वन, र समोच्च खेती जस्ता दिगो भूमि प्रयोग अभ्यासहरूलाई बढावा दिनुहोस्। क्षरण नियन्त्रण उपायहरू कार्यान्वयन गर्नुहोस् जस्तै चेक बाँधहरू निर्माण गर्ने, कभर बालीहरू रोप्ने, र नदी र ढलानहरूमा वनस्पति बफर स्ट्रिपहरू स्थापना गर्ने। {"\n"}
          <Text style={styles.boldText}> जल प्रदूषण: </Text>
          फोहोर पानी प्रशोधन सुविधाहरू अपग्रेड गर्नुहोस् र औद्योगिक र कृषिलाई पानीको स्रोतहरू दूषित हुनबाट रोक्नको लागि नियमहरू लागू गर्नुहोस्। रासायनिक मल र विषादीको प्रयोगलाई न्यूनीकरण गर्ने वातावरणमैत्री कृषि अभ्यासलाई प्रवर्द्धन गर्ने । उचित फोहोर विसर्जनको बारेमा जनचेतना अभिवृद्धि गर्नुहोस् र नदी र तालहरूको लागि समुदायको नेतृत्वमा सरसफाइ प्रयासहरूलाई प्रोत्साहित गर्नुहोस्। {"\n"}
          <Text style={styles.boldText}>सामुदायिक संलग्नता: </Text>
          वातावरण संरक्षण र व्यवस्थापनसँग सम्बन्धित निर्णय प्रक्रियाहरूमा स्थानीय समुदायहरूलाई समावेश गर्नुहोस्। सामुदायिक वन कार्यक्रम र पानी प्रयोगकर्ता संघहरू जस्ता दिगो स्रोत व्यवस्थापनका लागि समुदायको नेतृत्वमा गरिएका पहलहरूलाई समर्थन गर्नुहोस्। समुदायहरूलाई उनीहरूको प्राकृतिक स्रोतहरूको स्वामित्व लिन र दिगो अभ्यासहरू लागू गर्न सशक्त बनाउन प्रशिक्षण र स्रोतहरू प्रदान गर्नुहोस्। {"\n"}
          <Text style={styles.boldText}>शिक्षा र जागरूकता:  </Text>
          वातावरण संरक्षण र दिगो विकासको महत्त्व बारे चेतना जगाउन विद्यालय र समुदायहरूमा वातावरणीय शिक्षा कार्यक्रमहरू लागू गर्नुहोस्। व्यक्तिहरूलाई उनीहरूको दैनिक जीवनमा पर्यावरण-मैत्री अभ्यासहरू अपनाउन प्रोत्साहित गर्न व्यवहार परिवर्तन अभियानहरू प्रवर्द्धन गर्नुहोस्, जस्तै फोहोर घटाउने, पानीको संरक्षण गर्ने, र नवीकरणीय ऊर्जा पहलहरूलाई समर्थन गर्ने। {"\n"}
          {'\n'}यी समाधानहरू कार्यान्वयन गरेर र सरकारी निकायहरू, नागरिक समाज संगठनहरू, र स्थानीय समुदायहरू बीचको सहकार्यलाई बढावा दिएर, नेपालले वातावरणीय चुनौतीहरू न्यूनीकरण गर्न र अझ दिगो भविष्यको प्रवर्द्धन गर्न काम गर्न सक्छ।
        </Text>


        <Text style={styles.question}>Q4.	नेपालको मौसमी अवस्था प्रभावित गर्ने कारकहरू र बर्षाऋतुको अनियमितताको विश्लेषण गर्नुहोस्।</Text>
        <Text style={styles.answer}>

          मौसमी अवस्थाको प्रभावकारी कारकहरू : {'\n'}


          1.नापालको भौगोलिक स्थिति र हिमालयी पर्वत प्रणालीको प्रभाव
          तापक्रम र वर्षामा परिवर्तनशीलता {"\n"}

          2. नेपालका विभिन्न क्षेत्रहरूमा तापक्रम र वर्षा ढाँचामा विविधता।
          चरम तापक्रम र मौसमी अवधि {"\n"}

          3.चरम तापक्रमको प्रभाव र मौसमको अवधिमा हुने भिन्नताहरू, विशेष गरी चिसो मौसममा। {"\n"}


          4.  ढिलो मनसुन सुरु हुने, वातावरणीय परिवर्तनहरू
          वर्षा र तापमानमा अनियमितता:{"\n"}


          यी कारक र विश्लेषणहरूले नेपालको मौसम अवस्थाको जटिलता र मनसुन मौसममा देखिएका अनियमितताहरूका बारेमा अन्तर्दृष्टि प्रदान गर्दछ</Text>

        <Text style={styles.question}> Q5.नेपालमा प्राकृतिक प्रकोपका चुनौतीहरू न्यूनीकरण गर्ने उपायहरूबारे छलफल गर्नुहोस्</Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>Q6.नेपालको वन्यजन्तु र वनस्पतिको संरक्षणमा राष्ट्रिय निकुञ्ज र संरक्षित क्षेत्रहरूको प्रभावकारिता कसरी मूल्याङ्कन गर्न सक्छौ</Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>Q7.नेपालको शहरी क्षेत्रहरूमा वायु प्रदूषणको बारेमा कसरी आवाज छलफल गर्न सकिन्छ र जनस्वास्थ्य सुधार गर्न के उपायहरू गर्न सकिन्छ?</Text>
        <Text style={styles.answer}> </Text>
     
        <Text style={styles.question}> Q8 राष्ट्रिय विकास योजना र नीतिमा जैविक विविधता संरक्षणको कठिनाईहरू र अवसरहरूको मूल्यांकन गर्नुहोस्।</Text>
        <Text style={styles.answer}> 
        <Text style={styles.question}> चुनौतीहरू:</Text> {"\n"}

          1.राष्ट्रिय विकासमा जैविक विविधता संरक्षणको महत्त्वबारे नीति निर्माता र सरोकारवालाहरूबीच चेतना र बुझाइको कमी। {"\n"}
          2.संरक्षण लक्ष्यहरू र आर्थिक विकास प्राथमिकताहरू बीचको द्वन्द्व, प्रतिस्पर्धी चासो र स्रोत विनियोजन दुविधा निम्त्याउँछ।{"\n"}
          3.राष्ट्रिय स्तरमा जैविक विविधता संरक्षण उपायहरू लागू गर्न अपर्याप्त वित्तीय स्रोत र प्राविधिक क्षमता।{"\n"}
          4.जैविक विविधता संरक्षण प्रयासमा संलग्न सरकारी निकायहरू, गैरसरकारी संस्थाहरू र स्थानीय समुदायहरूबीच अपर्याप्त समन्वय र सहकार्य।{"\n"}
          5.असुरक्षित भूमि प्रयोग अभ्यास, वन फँडानी, बासस्थानको विनाश, र प्राकृतिक स्रोतहरूको अत्यधिक दोहनको दबाबले जैविक विविधताको हानिलाई बढाउँछ।{"\n"}

       <Text style={styles.question}> अवसरहरू: </Text> {"\n"}


       1.जैविक विविधताको अभिवृद्धि र मानव गतिविधिहरूमा यसको उपयोगले आवश्यक पारिस्थितिक प्रणाली सेवाहरूको प्रावधान मार्फत मानव कल्याणमा सुधार ल्याउँछ।{"\n"}
2.दिगो विकासका लागि आवश्यक महत्वपूर्ण मुद्दाहरूलाई सम्बोधन गर्ने विश्वसनीय विकास प्रवर्द्धनहरूमा जैविक विविधता संरक्षण समावेश।{"\n"}
3.जलवायु परिवर्तन र यसको न्यूनीकरण लगायतका विकास लक्ष्यहरू समावेश गर्दै जैविक विविधता संरक्षणलाई आधारभूत धाराहरूमा एकीकृत गर्ने अवसरहरू सिर्जना हुन्छन्।{"\n"}
4.जनचेतना र जैविक विविधता संरक्षणमा सहभागिताले शिक्षा, सञ्चार र सामुदायिक कार्यक्रमहरूले महत्त्वपूर्ण भूमिका खेल्ने अवसरहरू ल्याउँछ।{"\n"}
5.अन्तर्राष्ट्रिय आर्थिक सहयोग र साझेदारीले जैविक विविधता संरक्षण परियोजनाहरू र पहलहरूलाई समर्थन गर्दै, जैविक विविधता संरक्षणमा नेपालको योगदानलाई मद्दत गर्दछ। </Text>


      </View>
    </ScrollView>
  );
};

const styles = StyleSheet.create({
  container: {
    flex: 1,
    padding: 20,
    backgroundColor: '#ffffff',
  },
  scrollView: {},
  heading: {
    fontSize: 20,
    fontWeight: 'bold',
    marginBottom: 10,
  },
  question: {
    fontSize: 15,
    marginBottom: 10,
    fontWeight: 'bold',
  },
  answer: {
    fontSize: 16,
    color: '#333333',
    marginBottom: 20,
  },
  boldText: {
    fontWeight: 'bold',
  },
});

export default GeographyEnvironment;
