import { StyleSheet, Text, View,ScrollView } from 'react-native'
import React from 'react'

const SocialIssues = () => {
  return (
   
 
    <ScrollView contentContainerStyle={styles.container}>
  
      <View style={styles.questionsContainer}>
        <Text style={styles.question}>Q1. नेपालमा सामाजिक द्वन्द्वका प्रमुख मुख्य कारणहरू के हुन् र कसरी यी समस्याहरूलाई हल गर्न सकिन्छ? </Text>
        <Text style={styles.answer}> नेपालमा सामाजिक द्वन्द्वका मुख्य कारणहरू रोजगार असमानता, जातिय भेदभाव, सामाजिक विभेद, धर्मिक विवाद र सामुदायिक समस्याहरू हुन्छन्। यस्ता समस्याहरूको हल गर्नका लागि समानता, सामाजिक समृद्धि, शिक्षा र सशक्तिकरणको अभियानहरू गरिन्छन्। रोजगार असमानता हटाउन आर्थिक विकासका उपायहरू गर्नुपर्छ र जातिय विवाद र सामाजिक विभेदको खातिर कानुनी तथा संस्थागत परिवर्तनहरू ल्याउनुपर्छ।

</Text>
        <Text style={styles.question}> Q2. नेपालमा सामाजिक न्यायका लागि सरकारले कसरी काम गर्नुपर्छ ?</Text>
        <Text style={styles.answer}> नेपालमा सामाजिक न्यायका लागि सरकारले कसरी काम गर्नुपर्छ भन्ने प्रश्नमा सरकारले निम्नलिखित कदमहरू गर्नुपर्छ: { "\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}> 1.	कानुनी सुरक्षा:</Text> सरकारले सामाजिक न्यायको लागि कानुनी सुरक्षा तथा विधि प्रणाली विकसित गर्नुपर्छ। यसले न्याय विधान, अधिकार तथा कर्मचारीको साझा जिम्मेवारीको संरक्षा गर्दछ।{ "\n"}
 <Text style={{ ...styles.answer, fontWeight: 'bold' }}>2.	सामाजिक सेवा प्रदान:</Text> सरकारले समुदायको आवश्यकतामा आधारित सामाजिक सेवा प्रदान गर्नुपर्छ, जसमा विशेष रुपमा गरिब, अवसादित, अल्पसंख्यक, र अवस्थित वर्गका लोगहरूको संख्यालाई समावेश गर्नुपर्छ।{ "\n"}
 <Text style={{ ...styles.answer, fontWeight: 'bold' }}> 3.	शिक्षा र संचार: </Text>सामाजिक न्यायका लागि सरकारले शिक्षा र संचारको क्षेत्रमा प्राथमिकता दिनुपर्छ। यसले सबै वर्गहरूको शिक्षामा पहुँच तथा सामाजिक संचारमा समानता सुनिश्चित गर्दछ।{ "\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}> 4.	आर्थिक वित्तीय सहायता:  </Text>सरकारले आर्थिक वित्तीय सहायता प्रदान गर्नुपर्छ, विशेष रुपमा गरिब र असमर्थ वर्गहरूका लागि। यसले उनीहरूको आर्थिक स्थिति बेहतर बनाउँदछ र सामाजिक न्यायको सिद्धान्तमा अधिक निर्भर हुन्छ।{ "\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}> 5.	न्यायिक प्रक्रिया: </Text> सरकारले न्यायिक प्रक्रिया तथा न्यायिक सेवा प्रदान गर्नुपर्छ, जसले समाजमा न्यायको पहुँच र समानता सुनिश्चित गर्दछ।{ "\n"}
यस्ता उपायहरूको लागूगरी समाजमा न्यायको पहुँच र समानता सुनिश्चित गर्नमा महत्त्वपूर्ण भूमिका खेल्दछ।{ "\n"}
 </Text>
        <Text style={styles.question}> Q3.नेपालमा बालबालिकाहरूको शिक्षा सुनिश्चित गर्नका लागि 
के केउपायहरू aapauna सकिन्छ? 
 </Text>
        <Text style={styles.answer}>  नेपालमा बालबालिकाहरूको शिक्षा सुनिश्चित गर्नका लागि केहि केउपायहरू निम्नलिखित हुन्छन्:{ "\n"}

<Text style={{ ...styles.answer, fontWeight: 'bold' }}> शिक्षा अवसरका बारेमा जानकारी फैलाउनु: </Text>  समाजमा बालबालिकाहरूको शिक्षाको महत्त्वलाई समझाउन र उनीहरूलाई शिक्षामा रुचि देखाउन लागि, जनसंख्यामा जानकारीको पहुँच र शिक्षा अवसरका बारेमा जानकारीको प्रसार गर्न सकिन्छ।{ "\n"}

 <Text style={{ ...styles.answer, fontWeight: 'bold' }}> शिक्षा सुरक्षा तथा अधिकारको संरक्षण:</Text> नेपाल सरकारले शिक्षा सुरक्षा र अधिकारको संरक्षणमा कानूनी व्यवस्था गरेको छ। यसको अनुसार, शिक्षा सम्बन्धी अधिकारको संरक्षण गरी शिक्षा प्राप्ति गर्न सकिन्छ।{ "\n"}

<Text style={{ ...styles.answer, fontWeight: 'bold' }}> विद्यालय भ्रमण तथा खर्चको सहायता:</Text>  समाजमा गरिब बालबालिकाहरूको लागि निःशुल्क विद्यालय भ्रमणको व्यवस्था गर्ने, विद्यालय खर्चको सहायता प्रदान गर्ने तथा उनीहरूको परिवारलाई आर्थिक सहायता गर्ने कार्यक्रमहरू आयोजना गर्न सकिन्छ।{ "\n"}

 <Text style={{ ...styles.answer, fontWeight: 'bold' }}> शिक्षा संरचनामा समावेश: </Text> समाजमा समावेशी शिक्षा संरचनामा बदलाव गर्ने, विशेष रुपमा गरिब, अवसादित, अल्पसंख्यक, र असमर्थ वर्गका बालबालिकाहरूलाई समावेश गर्ने नीति अवलम्बन गर्न सकिन्छ।{ "\n"}

 <Text style={{ ...styles.answer, fontWeight: 'bold' }}> शिक्षा सामग्री र सुविधा: </Text> उपयुक्त शिक्षा सामग्री र सुविधाहरूको प्रदान गर्ने, जसले शिक्षार्थीहरूलाई उत्कृष्ट शिक्षा प्राप्ति गर्न सकिन्छ।{ "\n"}

यी उपायहरूले नेपालमा बालबालिकाहरूको शिक्षा सुनिश्चित गर्नमा महत्त्वपूर्ण भूमिका खेल्छन्। </Text> 
<Text> { "\n"}
<Text style={styles.question}> Q4. नेपालमा अल्पसंख्यक समुदायहरूको विकास र संरक्षणका लागि कुनै-कुनाका उपायहरू अभिवृद्धि गर्न सकिन्छ? </Text> </Text>

<Text style={styles.answer}> नेपालमा अल्पसंख्यक समुदायहरूको विकास र संरक्षणका लागि केहि कुनै उपायहरू निम्नलिखित हुन सक्छ:{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>1. सामाजिक संघर्षमा सहभागिता:</Text> सरकारले अल्पसंख्यक समुदायहरूको आवाज सुन्ने र समाधानको लागि समुदाय संघर्षमा सहभागिता बढाउनुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>2. शैक्षिक सुविधाहरूको प्रवाहीकरण:</Text> अल्पसंख्यक समुदायहरूको शैक्षिक सुविधाको पहुँच बढाउन सामाजिक संगठनहरू, सरकार, र अन्य स्थानीय संगठनहरूको सहयोग आवश्यक छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>3. रोजगार र सशक्तिकरण:</Text> अल्पसंख्यक समुदायहरूलाई रोजगार तथा आर्थिक सशक्तिकरणको लागि विशेष प्राथमिकता दिनुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>4. अधिकार संरक्षण:</Text> समुदायहरूको अधिकारहरूको संरक्षण गर्न, उनीहरूलाई न्याय प्राप्ति गर्न, र समाजमा समानता तथा उनीहरूको सशक्तिकरणलाई प्रोत्साहन गर्न।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>5. जल संसाधनको प्रबन्ध:</Text> अल्पसंख्यक समुदायहरूको जल संसाधनको प्रबन्ध गर्न, खासकरी जल आपदा प्रतिरोध, पुनर्निर्माण, र जल सामुदायिक व्यवस्थापनमा सहभागिता बढाउनुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>6. सामुदायिक संघर्ष र संगठना:</Text> सामुदायिक संघर्षमा अल्पसंख्यक समुदायहरूको समृद्धि र संरक्षण गर्न सहायक छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>7. संस्थागत परिवर्तन:</Text> सरकारले नीति तथा कानुनको माध्यमबाट संस्थागत परिवर्तन गर्नुपर्छ जसले अल्पसंख्यक समुदायहरूको अधिकार र स्थितिमा सुधार गर्न सहायक हुनेछ।{"\n"}
यस्ता उपायहरूको संयुक्त प्रयोगले अल्पसंख्यक समुदायहरूको विकास र संरक्षणमा सहायक हुनेछ।{"\n"}
</Text>

<Text style={styles.question}> Q5. नेपालमा युवाहरूको सशक्तिकरण र रोजगार निर्माणका लागि कुनै-कुनाका उपायहरू अभिवृद्धि गर्न सकिन्छ?</Text>
<Text style={styles.answer}> नेपालमा युवाहरूको सशक्तिकरण र रोजगार निर्माणका लागि केहि कुनै उपायहरू निम्नलिखित हुन सक्छ:{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>1. उद्योग तथा व्यापारका अवसरहरूको विस्तार:</Text> सरकारले युवाहरूलाई उद्योग तथा व्यापारका अवसरहरूमा प्रवेश गर्न सहयोग गर्ने कार्यक्रमहरू बढाउनुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>2. प्राविधिक शिक्षा र प्रशिक्षण:</Text> सरकारले युवाहरूको लागि आवश्यक प्राविधिक शिक्षा र प्रशिक्षण प्रदान गर्ने कार्यक्रमहरू विकसित गर्नुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>3. स्वावलम्बन तथा उद्यमिता कोचिङ:</Text> युवाहरूलाई स्वावलम्बन र उद्यमिता बढाउनका लागि कोचिङ तथा प्रशिक्षणका अवसर प्रदान गर्नुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>4. रोजगार सृजना:</Text> सरकारले रोजगार सृजना गर्न युवाहरूको लागि अनुदान, ऋण, र तात्कालिक अनुदान प्रदान गर्नुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>5. कृषि तथा उद्योग सम्बन्धी तालिम:</Text> युवाहरूलाई कृषि, उद्योग, तथा अन्य श्रम बाजारमा प्रवेशका लागि आवश्यक तालिम तथा प्रशिक्षण प्रदान गर्नुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>6. सामाजिक उत्थान र संगठना:</Text> युवाहरूको सामाजिक उत्थान र संगठना गर्नका लागि युवा समूहहरूको स्थापना र सहयोग गर्नुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>7. नीति तथा कानुनको सुधार:</Text> सरकारले युवाहरूलाई नैतिक र कानुनी सहायता प्रदान गर्न, र रोजगारमा आवश्यक नीति तथा कानुनको सुधार गर्नुपर्छ।{"\n"}
यी कार्यक्रमहरूको संयुक्त प्रयोगले युवाहरूको सशक्तिकरण र रोजगार निर्माणमा महत्त्वपूर्ण भूमिका खेल्नेछ।{"\n"}
</Text>

<Text style={styles.question}>
Q6. नेपालमा स्वास्थ्य सेवा पहुँचको समृद्धिका लागि कसरी उपायहरू अभिवृद्धि गर्न सकिन्छ?
</Text>
<Text style={styles.answer}> नेपालमा स्वास्थ्य सेवा पहुँचको समृद्धि गर्न केहि उपायहरू निम्नलिखित हुन सक्छ:{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>1. स्वास्थ्य सेवा निर्माण:</Text> सरकारले गाउँ र शहरका विभिन्न क्षेत्रमा स्वास्थ्य सेवा प्रदान गर्न लागि नयाँ स्वास्थ्य संचालनको केन्द्र स्थापना गर्ने र स्वास्थ्य सेवा केन्द्रहरूको निर्माण गर्ने।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>2. आवश्यक स्वास्थ्य कर्मीहरूको उत्पादन:</Text> सरकारले आवश्यक चिकित्सा कर्मीहरूको उत्पादन र स्वास्थ्य कर्मचारीहरूको संख्या बढाउने।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>3. जनताको शिक्षा र जागरूकता:</Text> स्वास्थ्य सेवा पहुँचको महत्त्व र महत्त्व बारे जनतामा शिक्षा र जागरूकता बढाउने कार्यक्रमहरू विकसित गर्नुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>4. विपद् प्रतिरोध तथा संक्रमण नियन्त्रण:</Text> स्वास्थ्य सेवा पहुँचको समृद्धिमा विपद् प्रतिरोध तथा संक्रमण नियन्त्रणका लागि उपायहरूको प्राथमिकता दिनुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>5. गरिबी र स्वास्थ्य सम्बन्धी नीति अनुकूलन:</Text> स्वास्थ्य सेवा पहुँचको समृद्धिमा गरिबी र स्वास्थ्य सम्बन्धी नीति अनुकूलन गर्नुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>6. स्वास्थ्य बचत योजना:</Text> सरकारले स्वास्थ्य बचत योजनाहरू विकसित गरेर जनतालाई आर्थिक रूपमा स्वास्थ्य सेवा पहुँच गराउने क्षमता प्रदान गर्नुपर्छ।{"\n"}
<Text style={{ ...styles.answer, fontWeight: 'bold' }}>7. जनस्वास्थ्य सेवा:</Text> सरकारले जनस्वास्थ्य सेवा प्रदान गर्ने क्षेत्रमा प्राथमिकता दिनुपर्छ, जसले जनतालाई निकटतम स्वास्थ्य सेवा प्रदान गर्ने क्षमता प्रदान गर्ने।{"\n"}
यी उपायहरूको संयुक्त प्रयोगले स्वास्थ्य सेवा पहुँचको समृद्धि गर्न सकिन्छ।{"\n"}
</Text>

       
        
        

        <Text style={styles.question}>
    यी प्रश्नहरू प्राथमिक स्तरका हुन्, तर तपाईं उच्च स्तरको परीक्षाको तयारी गरिरहेका छन् भने, तपाईंलाई थप उच्च स्तरको प्रश्नहरूको पनि तयारी गर्नुपर्नेछ।
        </Text>
     

      </View>
    </ScrollView>
  )
}


const styles = StyleSheet.create({
  container: {
    flexGrow: 1,
    paddingVertical: 20,
    paddingHorizontal: 10,
    backgroundColor: '#ffffff',
  },
  title: {
    fontSize: 20,
    fontWeight: 'bold',
    marginBottom: 20,
    textAlign: 'center',
  },
  questionsContainer: {
    alignItems: 'flex-start',
  },
  questionContainer: {
    marginBottom: 20,
  },
  question: {
    marginBottom: 10,
    fontSize: 16,
    lineHeight: 24,
    fontWeight: 'bold',
  },
  answer: {
    fontSize: 16,
    lineHeight: 24,
  },

  container: {
    padding: 10,
  },
  title: {
    fontSize: 18,
    fontWeight: 'bold',
    marginBottom: 10,
  },
  event: {
    marginBottom: 8,
    fontSize: 16,
  },
});




export default SocialIssues

