import { StyleSheet, Text, View, ScrollView } from 'react-native'
import React from 'react'

const Geography = () => {
  return (
    <ScrollView contentContainerStyle={styles.container}>
      <Text style={styles.title}>नेपालको लोक सेवा परीक्षाका लागि प्रश्नहरू</Text>
      <View style={styles.questionsContainer}>
        <Text style={styles.question}>
          १. नेपालको संघीय लोकतान्त्रिक गणतन्त्रको स्थापना कहिले भएको थियो र यसको महत्व के हो?
        </Text>
        <Text style={styles.answer}> नेपालको संघीय लोकतान्त्रिक गणतन्त्रको स्थापना २०६२ सालमा भएको थियो।
          यस समयमा नेपालमा राजनीतिक विवादहरू थिए र जनसंघर्षका परिणामस्वरूप १९९० सालमा संविधानमा परिवर्तन गरिएको थियो र
          सामाजिक तथा राजनीतिक परिवर्तनका आधारमा संघीय लोकतान्त्रिक गणतन्त्र स्थापना भएको थियो।
          {"\n"}

          संघीय लोकतान्त्रिक गणतन्त्रको स्थापनाले नेपालमा जनताको सहभागिता, स्वतन्त्रता, न्याय,
          तथा विकासका मूल्यहरूलाई प्रधानतः स्थायी बनाएको छ। यसले नेपालको राजनीतिक, सामाजिक,
          तथा आर्थिक विकासमा महत्वपूर्ण योगदान पुर्‍याउन सहयोग गरेको छ। लोकतान्त्रिक गणतन्त्रले नागरिकहरूलाई तालिम,
          सम्पत्ति अधिकार, तथा स्वतन्त्रताका मूल्यहरूको सम्मान गर्ने अवस्था प्रदान गर्दछ।
          यसले नेपालको सामाजिक समृद्धि, शान्ति, र अभिवृद्धि गर्नमा महत्वपूर्ण भूमिका खेलेको छ।</Text>
        <Text style={styles.question}>
          २. नेपालको राजनीतिक संरचना के हो र यसमा कती प्रदेश छन्?
        </Text>
        <Text style={styles.answer}> नेपालको राजनीतिक संरचना तथा व्यवस्थामा ७ प्रदेश छन्।
          यी प्रदेशहरू नेपालको संघीय राज्यतन्त्रको एक महत्वपूर्ण अंग हुन् जसमा संघीय, प्रदेशीय, तथा स्थानीय स्तरका सरकारहरू छन्। यस्तै,
          प्रदेशहरूले स्वतन्त्र नीति तथा कानून बनाउने व्यवस्था पारिस्थितिक विकास तथा स्थानीय विकास कार्यक्रम चलाउने अधिकार राख्छन्।</Text>
        <Text style={styles.question}>
          ३. नेपालको संघीय संविधानको निर्माण कहिले भएको थियो र मुख्य उद्देश्य के हो?
        </Text>

        <Text style={styles.answer}>नेपालको संघीय संविधानको निर्माण २०७२ सालमा भएको थियो। मुख्य उद्देश्य थियो संघीय लोकतान्त्रिक गणतन्त्रको स्थापना,
          सामाजिक न्याय, राष्ट्रिय एकता, सामाजिक समावेश, राजनीतिक दलितहरूको समावेश, र सार्वजनिक शान्ति तथा सुरक्षा गर्ने बिशेष उद्देश्य ho </Text>

        <Text style={styles.question}>
          ४. संघीय संविधानको अनुच्छेद ३५ के बारेमा के भन्छ र यसको महत्व के हो?
        </Text>

        <Text style={styles.answer}> संघीय संविधानको अनुच्छेद ३५ नेपालको संविधानमा रहेको एक महत्वपूर्ण अनुच्छेद हो। यो अनुच्छेदले नेपालको नागरिकहरूलाई मूलभूत मानव अधिकारहरूको संरक्षण गर्ने व्यवस्था गरेको छ। यसले समानता, अधिकार तथा कर्तव्यको मूल आधारमा समाजलाई समृद्ध बनाउने काम गरेको छ।  {"\n"}

          यस अनुच्छेदले नागरिकहरूको अधिकारको सुरक्षा गर्ने व्यवस्था राखेको छ, जसमा अधिकारहरूको सूची दिइएको छ जसले नागरिकहरूको स्वतन्त्रता, न्याय, विश्वास, समानता, तथा शान्ति गर्व र समानताका आधारमा बस्ने हक हुनेछ। {"\n"}

          यो अनुच्छेद महत्त्वपूर्ण हो किनकि यसले नागरिकहरूको मूलभूत मानव अधिकारहरूको संरक्षण गर्दछ र समाजमा समानता र न्यायको स्थापना गर्दछ। यसको अनुपालनले नेपालको सामाजिक, राजनीतिक र आर्थिक विकासमा महत्त्वपूर्ण भूमिका खेल्न सहायक हुन्छ।</Text>

        <Text style={styles.question}>
          ५. नेपालको संघीय संविधानमा राज्यको सुशासन निर्देशक सिद्धान्त के हो र यसको महत्व के हो?
        </Text>

        <Text style={styles.answer}> नेपालको संघीय संविधानमा राज्यको सुशासन निर्देशक सिद्धान्त एक महत्वपूर्ण अवधारणा हो। यस सिद्धान्तले राज्यले शक्ति कसरी प्रयोग गर्नुपर्छ र कसरी लोकतान्त्रिक र संविधानिक मूल्यहरूको पालना गर्नुपर्छ भन्ने निर्देशन प्रदान गर्दछ। {"\n"}

          सुशासन निर्देशक सिद्धान्तको महत्व यो हो कि यसले राज्यलाई समृद्ध, न्यायपूर्ण, लोकतान्त्रिक, तथा सामाजिक रूपमा समान, समर्थ र सुरक्षित बनाउने लक्ष्यमा आधारित नीति र कार्यक्रम प्रदान गर्दछ। यसले राज्यले नागरिकहरूको सुरक्षा, समृद्धि, तथा उनीहरूको हितको रक्षा गर्ने कार्यमा महत्वपूर्ण भूमिका खेल्छ। {"\n"} {"\n"}

          सुशासन निर्देशक सिद्धान्तले राज्यलाई विभिन्न क्षेत्रमा नैतिकता, पारदर्शिता, तथा न्यायपूर्णता जस्ता मूल्यहरूको पालना गर्न सहायता प्रदान गर्दछ र समृद्ध तथा समान समाज निर्माणमा महत्त्वपूर्ण भूमिका खेल्छ। त्यसैले, यो सिद्धान्त राज्यको नीति, कानुन, र कार्यक्रमहरूमा न्यायपूर्णता, सामाजिक न्याय, तथा लोकतान्त्रिक मूल्यहरूको पालना र संरक्षण गर्न महत्त्वपूर्ण भूमिका खेल्छ।</Text>

        <Text style={styles.question}>
          ६. संघीय संविधानमा कितने भाग छन् र तिनको नाम के हो?
        </Text>

        <Text style={styles.answer}> नेपालको संघीय संविधानमा तीन भाग छन्, जुनहरूको नामहरू निम्नलिखित छन्: {"\n"}

          (१)प्रस्तावना भाग (Preamble) {"\n"}
          (२)मूल अधिकार भाग (Fundamental Rights) {"\n"}
          (३)नैतिक अधिकार भाग (Directive Principles and Policies of the State)</Text>



        <Text style={styles.question}>
          ७. नेपालको संघीय संविधानमा अनुच्छेद ८७ के अनुसार राष्ट्रपति कसरी नियुक्त हुन्छ?
        </Text>

        <Text style={styles.answer}>
          नेपालको संघीय संविधानमा अनुच्छेद ८७ को अनुसार, राष्ट्रपतिको नियुक्ति गर्ने प्रक्रिया निम्नलिखित छ:{"\n"}

          -राष्ट्रपतिले संघीय संसदको सदस्यहरूको प्रतिनिधित्वमा रहेका एक प्रतिनिधि समूहको सिफारिसमा राष्ट्रपति नियुक्ति गर्नुपर्छ।{"\n"}
          -त्यस्तो प्रतिनिधि समूहले राष्ट्रपति नियुक्ति गर्ने प्रतिनिधि चयन गर्नुपर्छ।{"\n"}
          -यो प्रतिनिधि समूहले ध्यान दिएको प्रमाण प्राप्त गरेको संविधानमा व्यवस्था अनुसार राष्ट्रपति नियुक्ति गरिनेछ।{"\n"} {"\n"}
          यसले यस्तो स्पष्ट बनाउँछ कि राष्ट्रपतिले संघीय संसदको प्रतिनिधित्वमा रहेका प्रतिनिधि समूहको सिफारिसमा मात्र राष्ट्रपति नियुक्ति गर्न सक्नुहुनेछ।</Text>

        {/* this tis just fir one qustion */}
        <Text style={styles.question}>
          ८. नेपालका इतिहासमा महत्त्वपूर्ण घटनाहरूको उल्लेख गर।
        </Text>

        <View style={styles.container}>
          <Text style={styles.title}>महत्त्वपूर्ण घटनाहरू:</Text>

          <Text style={styles.event}>
            १. पृथ्वीनारायण शाहको एकीकरण (१७६८): गोरखाका राजा पृथ्वीनारायण शाहले नेपालको एकीकरणको अभियान सुरु गरेर छोटा राज्यहरूलाई एकीकृत राष्ट्रमा ल्याएर १७६८ मा आधुनिक नेपालको स्थापना गरिन्।
          </Text>

          <Text style={styles.event}>
            २. सुगौली सन्धि (१८१५-१८१६): अंग्रेजी पूर्व भारत कम्पनी र नेपालको बीचमा भएको अंग्रेजी-नेपाली युद्धपछि सुगौली सन्धि हस्ताक्षर गरिएको थियो। यस सन्धि अनुसार, नेपालले टेराईका ठूला भागहरू जस्तै क्षेत्र नेपालसँग सम्झौता गरेको थियो र ब्रिटिस भारतसँग राजनैतिक सम्बन्ध बनाएको थियो।
          </Text>

          <Text style={styles.event}>
            ३. राणा शासन (१८४६-१९५१): १८४६ को कोट हत्याकाण्डपछि, राणा वंशले नेपालमा नियमन स्थापना गरेर सैतानिक अधिकारवाद स्थापना गरेका थिए। यो युगमा, शाह राजा निजी व्यक्ति मात्र हुन् र राणाहरूले वास्तविक राजनीतिक शक्ति पार्ने थिए।
          </Text>

          <Text style={styles.event}>
            ४. लोकतन्त्रको स्थापना (१९५१): राणा शासनको अवशेष तोड्न नेपाल काँग्रेस पार्टीले गरेको १९५१ मा नेपालमा लोकतन्त्रको स्थापना हुँदा।
          </Text>

          <Text style={styles.event}>
            ५. नेपाली जनयुद्ध (१९९६-२००६): नेपालमा सरकार र माओवादी विद्रोहीहरू बीच भएको जनयुद्ध, जसले बडी संख्यामा जनताको जीवनको नुक्सान गरेको थियो र अन्ततः २००८ मा राजतन्त्रको समाप्ति गरेपछि नेपाललाई संघीय लोकतान्त्रिक गणतन्त्र घोषणा गरिएको थियो।
          </Text>

          <Text style={styles.event}>
            ६. संघीय लोकतान्त्रिक गणतन्त्रको अनुसन्धान (२००८): नेपालले २००८ मा संघीय लोकतान्त्रिक गणतन्त्र घोषणा गरेको थियो।
          </Text>
        </View>


        <Text style={styles.question}>
          ९. नेपालको राजनीतिक संरचना र विभाजन कसरी गरिएको छ?
        </Text>

        <Text style={styles.answer}> नेपालको संघीय राज्यको मुख्य संरचना तीन स्तरको सरकारमा आधारित छ:{"\n"}

          १. संघीय सरकार :{"\n"} संघीय सरकारले नेपालको पूर्णका ७ प्रदेशहरूमा सरकारी अधिकारहरू प्रयोग गर्ने अधिकार राख्दछ। संघीय सरकार नेपालको अन्तर्राष्ट्रिय कार्यक्रम, राष्ट्रिय सुरक्षा, संघीय कर, राष्ट्रिय सम्पत्ति, आर्थिक विकास लगायतका क्षेत्रमा सकारात्मक प्रयोग गर्दछ। {"\n"}

          २. प्रदेश सरकार (प्रदेशको सरकार):{"\n"} प्रदेश सरकारहरूले नेपालको संघीय सरकारको अधीनमा रही आफ्नो प्रदेशको कानून, न्याय, स्वास्थ्य, शिक्षा, प्रकृति, स्थानीय विकास लगायतका क्षेत्रमा कार्य सम्पादन गर्दछन्। {"\n"}

          ३. स्थानीय सरकार (नगरपालिका र गाउँपालिका): {"\n"}स्थानीय सरकारहरूले नगरपालिका र गाउँपालिकाहरूको रूपमा रही आफ्नो क्षेत्रमा नागरिक सेवा, स्थानीय विकास, सार्वजनिक निर्देशन, स्वास्थ्य, शिक्षा, प्राकृतिक संसाधन व्यवस्थापन लगायतका काम सम्पादन गर्दछन्।{"\n"}

          संघीय राज्यको अधिकारहरू अनेक क्षेत्रमा विभाजित गरिएका छन्, जसले प्रत्येक स्तरको सरकारलाई आफ्नो क्षेत्रमा अधिकार राख्न अनुमति दिन्छ। केहि महत्त्वपूर्ण संघीय राज्यको आधारभूत अधिकारहरूमध्ये निम्नलिखित पर्छन्:{"\n"}

          १. संघीय सरकारको अधिकारहरू:{"\n"}

          -विदेशी कार्य{"\n"}
          -राष्ट्रिय सुरक्षा{"\n"}
          -संघीय कर तथा संघीय संपत्ति{"\n"}
          २. प्रदेश सरकारको अधिकारहरू:{"\n"}

          -प्रदेशका सभासदको निर्वाचन{"\n"}
          -प्रदेशको कानून तथा न्याय{"\n"}
          -स्वास्थ्य र शिक्षा{"\n"}
          ३. स्थानीय सरकारको अधिकारहरू:{"\n"}

          -नगरपालिका र गाउँपालिकाको निर्वाचन{"\n"}
          -स्थानीय अर्थतन्त्रको प्रबन्ध{"\n"}
          -स्थानीय सेवा तथा सार्वजनिक निर्देशन{"\n"}
          यसरी, संघीय राज्यको संरचना र आधारभूत अधिकारहरूले नेपालमा शक्ति र प्रशासनिक व्यवस्था को सजावट गरेका छन्।</Text>



        <Text style={styles.question}>
          १२.संघीय राज्यको संरचना र आधारभूत अधिकारहरूको विवरण गर।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          १३.संविधानमा उल्लेख गरिएका नागरिक स्वतन्त्रता र अधिकारहरू के के हुन्?
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          १४.नेपालको अर्थतन्त्र, उद्योग, रोजगार र विकासमा चुनौतीहरूको विश्लेषण गर।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          १५.सामाजिक र आर्थिक विकासको लागि सरकारी योजनाहरूको अध्ययन गर।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          १६.सार्वजनिक स्वास्थ्य तथा शिक्षा व्यवस्थाको महत्त्व र चुनौतीहरूको अध्ययन गर।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          १७.नेपालको भूगोल, पर्वत, नदी, तराई र उत्तराखण्डको विवरण गर।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          १८.नेपालका संविधान, राष्ट्रियता, राष्ट्रिय एकता र अधिकारहरूको महत्व र आधारभूत विवरण गर।
        </Text>
        <Text style={styles.answer}> </Text>


        <Text style={styles.question}>
          १९.नेपालको विशेष इतिहास र ऐतिहासिक घटनाहरूको अध्ययन गर्नुहोस्।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          २०. संविधानिक व्यवस्था र संविधानको महत्व कसरी हो?
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          २१.नेपालको संघीय, प्रदेशीय, र स्थानीय शासनको संरचना र यसको कार्यावधि तथा अधिकारहरूको विवरण गर्नुहोस्।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          २२.सार्वजनिक सेवामा समावेश र भिन्नता कसरी सुनिश्चित गर्न सकिन्छ?
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          २३.सरकारी कर्मचारी चयनको प्रक्रिया र तत्वहरूको वर्णन गर्नुहोस्।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          २४.राष्ट्रिय नीति तथा योजनाहरूको विवरण गर्नुहोस् र तिनको प्रभावको मूल्यांकन गर्नुहोस्।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          २५.राजनीतिक, सामाजिक, आर्थिक, र पर्यावरणीय चुनौतीहरूको विश्लेषण गर्नुहोस् र समाधानको सुझाव दिनुहोस्।
        </Text>
        <Text style={styles.answer}> </Text>


        <Text style={styles.question}>
          २७.नेपालको अर्थतन्त्र, उद्योग, व्यापार, निर्यात, र उत्पादन सम्बन्धी चुनौतीहरूको विवरण गर्नुहोस्।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          २८.समाज सेवा, स्वास्थ्य, शिक्षा, तथा पर्यटन सेवाहरूको संरचना र विकासमा कुनै सुधारका लागि सुझाव गर्नुहोस्।
        </Text>
        <Text style={styles.answer}> </Text>

        <Text style={styles.question}>
          २९.यी प्रश्नहरू प्राथमिक स्तरका हुन्, तर तपाईं उच्च स्तरको परीक्षाको तयारी गरिरहेका छन् भने, तपाईंलाई थप उच्च स्तरको प्रश्नहरूको पनि तयारी गर्नुपर्नेछ।
        </Text>
        <Text style={styles.answer}> </Text>

      </View>
    </ScrollView>
  )
}


export default Geography


const styles = StyleSheet.create({
  container: {
    flexGrow: 1,
    paddingVertical: 20,
    paddingHorizontal: 10,
    backgroundColor: '#ffffff',
  },
  title: {
    fontSize: 20,
    fontWeight: 'bold',
    marginBottom: 20,
    textAlign: 'center',
  },
  questionsContainer: {
    alignItems: 'flex-start',
  },
  questionContainer: {
    marginBottom: 20,
  },
  question: {
    marginBottom: 10,
    fontSize: 16,
    lineHeight: 24,
    fontWeight: 'bold',
  },
  answer: {
    fontSize: 16,
    lineHeight: 24,
  },

  container: {
    padding: 10,
  },
  title: {
    fontSize: 18,
    fontWeight: 'bold',
    marginBottom: 10,
  },
  event: {
    marginBottom: 8,
    fontSize: 16,
  },
});